In [19]:
# 판다스는 액셀의 파이썬 버전이라고 비유하고 설명
# 표가 판다스에서는 DataFrame 입니다. DataFrame은 Series를 여러개 붙여서 만들어진다.

In [20]:
import pandas as pd

nums = [i for i in range(1, 11)]
nums

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

## Series 데이터 생성 방법

In [21]:
series_nums = pd.Series(nums)
series_nums

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### 애꿎은 list 를 Series로 만들어서 뭐하냐
-> 판다스의 다양한 기능을 사용할 수 있다.

In [22]:
series_nums.mean()
# 평균값

5.5

In [23]:
series_nums.describe()

count    10.00000
mean      5.50000
std       3.02765
min       1.00000
25%       3.25000
50%       5.50000
75%       7.75000
max      10.00000
dtype: float64

## DataFrame 생성 방법

In [24]:
nums = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9],
]

dfNums = pd.DataFrame(nums)
dfNums

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [25]:
# Series 와 DataFrame 의 관계
# 여러개의 시리즈를 합친게 바로 데이터프레임

type(dfNums)

pandas.core.frame.DataFrame

In [26]:
dfNums[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [27]:
type(dfNums[0])

pandas.core.series.Series

## DataFrame 을 생성하는 다른 방법
- 리스트 전달(위에서 했던 방식)

In [28]:
users = [
    ["철수", 180, 5],
    ["민수", 170, 5],
    ["철수", 130, 5],
]

dfUsers = pd.DataFrame(users)
dfUsers

    0    1  2
0  철수  180  5
1  민수  170  5
2  철수  130  5

컬럼 이름을 설정해주자

In [29]:
dfUsers.columns = ["name", "height", "age"]
dfUsers

  name  height  age
0   철수     180    5
1   민수     170    5
2   철수     130    5

딕셔너리 전달

In [ ]:
users = [
    "name" : ['철수','민수','짱구'],
    'height' : [180,170,103],
    'age' : [25,30,5],
]